Revit 2024 API
RebarShapeConstraint180DegreeDefaultBend Members
The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.
Constructors
Name | Description
RebarShapeConstraint180DegreeDefaultBend
 Create a 180-degree bend constraint.
Methods
Name | Description
Dispose |  (Inherited from RebarShapeConstraint.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParamId
 Return the Id of the parameter associated with this constraint.
 (Inherited from RebarShapeConstraint.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraint180DegreeDefaultBend Class
Autodesk.Revit.DB.Structure Namespace